DataProcessors/ВыгрузкаСчетФактур_В_ФАЙЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаСчетФактур_В_ФАЙЛ</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ЗонаОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ЗонаОтгрузки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКоробок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерМестаОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПрихода</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/БольшаяЯчеистаяСборка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>БольшаяЯчеистаяСборка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвижениеТары</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТарыПоШК</xr:Item>
				<xr:Item>AccumulationRegister.ЗонаОтгрузки</xr:Item>
				<xr:Item>InformationRegister.РегТарыПоШК</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Возврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходитВКомплект</Name>
					<Comment>Данный Документ входит в комплектом сборок</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументСписания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеТовараСЗоныОтгрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКоробокПриПроверке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплектБЯС</Name>
					<Comment>Документ комплект в котый входит данная сборка</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коробки</Name>
					<Comment>Количество коробок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПоказыватьВСписке</Name>
					<Comment>Не показывать в списке НЕ РАСПРЕДЕЛЕННЫХ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомераСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийОбъем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПогрузкаВАвто</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПогрузкаТоваровВАвтомобиль</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутевойЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПутевойЛист_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшивкиРаспечатанны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реестр</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реестр</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Самовывоз</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатыРаспечатаны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСборки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеСборки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Списан</Name>
					<Comment>Списание товара с зоны отгрузки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокМестХранений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СформированВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКомплект</Name>
					<Comment>Данный Документ Является комплектом сборок</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолТара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратВодителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратПоставщику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдресаДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыРасхода</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Док</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетФ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проверен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолПозиций</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АдресаДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МестаОтгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МестоОтгрузки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКоробок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыКомплекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокБЯС</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Тара</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контейнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Тара</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ВыгрузкаСчетФактур_В_ФАЙЛ/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сотрудники(Команда)
	СотрудникиСЕРВЕР();
КонецПроцедуры

&НаСервере
Процедура СотрудникиСЕРВЕР()
		
	ТК.Очистить();
	ТК.ДобавитьСтроку("UNISTRING;NAME;PROF_ID;USE;PHONE;SMS_MESSAGE_TYPE_ID");
	//Добавляем Строки Сотрудников
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизическиеЛица.Код,
	|	ФизическиеЛица.Наименование,
	|	ФизическиеЛица.Должность,
	|	ФизическиеЛица.Автомобиль
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.Должность = &Должность";
	
	Запрос.УстановитьПараметр("Должность", Справочники.Должности.Водитель);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Стр=""+
		"'"+(ВыборкаДетальныеЗаписи.Код) + "';" +	//UNISTRING
		"'"+ВыборкаДетальныеЗаписи.Наименование + "';" +//NAME
		"2;"+			//PROF_ID
		"1;"+			//USE
		";"+			//PHONE
		";";			//SMS_MESSAGE_TYPE_ID
		
		ТК.ДобавитьСтроку(Стр);
	КонецЦикла;
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Автомобили(Команда)
	АвтомобилиСЕРВЕР();
КонецПроцедуры

&НаСервере
Процедура АвтомобилиСЕРВЕР()
	ТК.Очистить();
	ТК.ДобавитьСтроку("UNISTRING;NAME;NNUMBER;MAXWEIGHT;"+
	"MAXVOLUME;MAXPALLETE;CARUSED;GAS_ID;EXPENGAS0;EXPENGAS1;EXPENGAS01;EXPENGAS11;"+
	"TRUCK_PAS;GRUZTYP_ID;START_WORK;FINISH_WORK;SPEED;SPEEDOUT;NAEMNIY;VODITEL_ID;"+
	"EXPEDITOR_ID;ENTERPRISE_ID;TARIFH;USED_TARIF_KM0;TARIF_KM0;USED_TARIF_KM1;"+
	"TARIF_KM1;DISPATCH_CENTER_ID;");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Автомобили.Код,
	|	Автомобили.Наименование,
	|	Автомобили.ГосударственныйНомер,
	|	Автомобили.МаркаАвтомобиля,
	|	ФизическиеЛица.Код КАК ВодительКОд,
	|	ФизическиеЛица.Наименование КАК Водитель
	|ИЗ
	|	Справочник.Автомобили КАК Автомобили
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО ФизическиеЛица.Автомобиль = Автомобили.Ссылка";
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Стр=""+
		"'"+ВыборкаДетальныеЗаписи.Код +"';"+	//UNISTRING
		"'"+ВыборкаДетальныеЗаписи.МаркаАвтомобиля +"';"+	//NAME
		"'"+ВыборкаДетальныеЗаписи.ГосударственныйНомер +"';"+	//NNUMBER
		";"+//MAXWEIGHT
		";"+//MAXVOLUME
		";"+//MAXPALLETE
		"1;"+//CARUSED
		";"+//GAS_ID
		";"+//EXPENGAS0
		";"+//EXPENGAS1
		";"+//EXPENGAS01
		";"+//EXPENGAS11
		"0;"+//TRUCK_PAS
		";"+//GRUZTYP_ID
		";"+//START_WORK
		";"+//FINISH_WORK
		";"+//SPEED
		";"+//SPEEDOUT
		";"+//NAEMNIY
		"'"+ВыборкаДетальныеЗаписи.ВодительКОд +"';"+//VODITEL_ID
		";"+//EXPEDITOR_ID
		";"+//ENTERPRISE_ID
		";"+//TARIFH
		";"+//USED_TARIF_KM0
		";"+//TARIF_KM0
		";"+//USED_TARIF_KM1
		";"+//TARIF_KM1
		"1;";//DISPATCH_CENTER_ID
		
		ТК.ДобавитьСтроку(Стр);
		
	КонецЦикла;
	
	
	
	
	
	
КонецПроцедуры



&НаКлиенте
Процедура РасходникиЗаПериод(Команда)
	
	ТК.Очистить();

	РасходникиЗаПериодСЕРВЕР();
	
КонецПроцедуры

&НаСервере
Процедура РасходникиЗаПериодСЕРВЕР()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	  "ВЫБРАТЬ
	 |	БольшаяЯчеистаяСборка.Ссылка
	 |ИЗ
	 |	Документ.БольшаяЯчеистаяСборка КАК БольшаяЯчеистаяСборка
	 |ГДЕ
	 |	БольшаяЯчеистаяСборка.Дата >= &ДатаН
	 |	И БольшаяЯчеистаяСборка.Дата <= &ДатаК";
	
	Запрос.УстановитьПараметр("ДатаК", ДатаК);
	Запрос.УстановитьПараметр("ДатаН", ДатаН);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	ТК.ДобавитьСтроку("UNISTRING;NUMBER_DOC;FROM_ID;TO_ID;DOC_DATE;"+
	"SUMMA;MASSA;OBEM;COMMENTS;QTY;DOCS_TYPE;INTERM_ID;"+
	"KOL_VO_PALLET;GRUZ_TYPE_ID;DELETED;TIME1;TIME2;AVAILABILITY_TIME;");

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВыгрузкаБЯССЕРВЕР(ВыборкаДетальныеЗаписи.Ссылка) ;

	КонецЦикла;

	

КонецПроцедуры


&НаКлиенте
Процедура Сохранить(Команда)
	//-------------------------------------
	Режим = РежимДиалогаВыбораФайла.Открытие;
ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
ДиалогОткрытияФайла.ПолноеИмяФайла = "";
Текст = "ru = ""Текст""; en = ""Text""";
Фильтр = НСтр(Текст)+"(*.csv)|*.csv";
ДиалогОткрытияФайла.Фильтр = Фильтр;
ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
ДиалогОткрытияФайла.Заголовок = "Выберите файл";
Если ДиалогОткрытияФайла.Выбрать() Тогда
    Путь = ДиалогОткрытияФайла.ПолноеИмяФайла;
Иначе
    Текст = "ru = ""Файл(ы) не выбран!""; en = ""File(s) not selected!""";
    Сообщить(НСтр(Текст));
КонецЕсли;

	//-------------------------------------
	  ТК.Записать(Путь,КодировкаТекста.Системная);
	   Сообщить("Файл Сохранен.- "+ Путь);

КонецПроцедуры


&НаКлиенте
Процедура Обзор(Команда)
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Путь="C:\Backup1C\docs.csv";
	ДатаН=НачалоДня(ТекущаяДата());
	ДатаК=КонецДня(ТекущаяДата());
	ДатаОстатков=ТекущаяДата();
КонецПроцедуры

&НаСервере
Процедура ВыгрузкаБЯССЕРВЕР(ДокБЯС)
	
//Сообщить(ДокБЯС);
	
	//ТК.ДобавитьСтроку("UNISTRING;NUMBER_DOC;FROM_ID;TO_ID;DOC_DATE;"+
	//"SUMMA;MASSA;OBEM;COMMENTS;QTY;DOCS_TYPE;INTERM_ID;"+
	//"KOL_VO_PALLET;GRUZ_TYPE_ID;DELETED;TIME1;TIME2;AVAILABILITY_TIME;");

		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.СчетФ,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.ДокНомер КАК Номер,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Комментарий,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.ДатаДокумента КАК Дата,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Количество,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Сумма,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.КолПозиций,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Ссылка.Получатель.Код КАК КонтрагентКод,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Ссылка.Организация,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Объем,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Вес
	               |ИЗ
	               |	Документ.БольшаяЯчеистаяСборка.ДокументыРасхода КАК БольшаяЯчеистаяСборкаДокументыРасхода
	               |ГДЕ
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Ссылка = &Ссылка"	;
	
	
	
	Запрос.УстановитьПараметр("Ссылка",ДокБЯС);
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		//------- TO_ID --------//
		
		ТО_ИД=ВыборкаДетальныеЗаписи.КонтрагентКод;
 
		найтиПризнакОКСИМЕД=Найти(ВыборкаДетальныеЗаписи.Номер,"*");
		Если найтиПризнакОКСИМЕД>0 Тогда
			ТО_ИД="ОКСИ"+Сред(ВыборкаДетальныеЗаписи.КонтрагентКод,4);
		КонецЕсли;
		
		найтиПризнакПРОЕКТ1000=Найти(ВыборкаДетальныеЗаписи.СчетФ,"*");
		Если найтиПризнакПРОЕКТ1000>0 Тогда
			ТО_ИД="ПрТ"+Сред(ВыборкаДетальныеЗаписи.КонтрагентКод,9);
		КонецЕсли;


		
		
		Стр=""+// Строка(ДокБЯС) +
		"'"+ВыборкаДетальныеЗаписи.Номер +"';"+	//UNISTRING
		"'"+ВыборкаДетальныеЗаписи.СчетФ +"';"+	//NUMBER_DOC
		"'"+ВыборкаДетальныеЗаписи.Организация +"';"+//FROM_ID
		"'"+ТО_ИД +"';"+	//TO_ID
		"'"+Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy") +"';"+	//DOC_DATE   Формат(ВыборкаДетальныеЗаписи.Дата,"ДФ=dd.MM.yyyy")
		""+Формат(ВыборкаДетальныеЗаписи.Сумма,"ЧДЦ=2; ЧГ=0") +";"+//SUMMA
		""+Формат(ВыборкаДетальныеЗаписи.Вес,"ЧДЦ=3; ЧГ=0") +";"+//MASSA
		""+Формат(ВыборкаДетальныеЗаписи.Объем,"ЧДЦ=3; ЧГ=0") +";"+//OBEM
		"'"+СтрЗаменить( ВыборкаДетальныеЗаписи.Комментарий,";", "") +"';"+	//COMMENTS
		""+Формат(ВыборкаДетальныеЗаписи.Количество,"ЧДЦ=0; ЧГ=0") +";"+//QTY
		"1;"+//DOCS_TYPE
		";"+//INTERM_ID
		";"+//KOL_VO_PALLET
		";"+//GRUZ_TYPE_ID
		";"+//DELETED
		";"+//TIME1
		";"+//TIME2
		";";//AVAILABILITY_TIME
		ТК.ДобавитьСтроку(Стр);
		
	КонецЦикла;
	
	 	
	
КонецПроцедуры


&НаКлиенте
Процедура СчетФактурыВЗонеОтгрузки(Команда)
	ТК.Очистить();
	СчетФактурыВЗонеОтгрузкиСЕРВЕР();
КонецПроцедуры


&НаСервере
Процедура СчетФактурыВЗонеОтгрузкиСЕРВЕР()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗонаОтгрузкиОстатки.ДокументПрихода КАК Ссылка,
		|	СУММА(ЗонаОтгрузкиОстатки.КоличествоКоробокОстаток) КАК КоличествоКоробокОстаток
		|ИЗ
		|	РегистрНакопления.ЗонаОтгрузки.Остатки(&ПЕРИОД, ДокументПрихода.Самовывоз = ЛОЖЬ) КАК ЗонаОтгрузкиОстатки
		|ГДЕ
		|	ЗонаОтгрузкиОстатки.КоличествоКоробокОстаток > 0
		|	И ЗонаОтгрузкиОстатки.НомерМестаОтгрузки.Палет = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗонаОтгрузкиОстатки.ДокументПрихода";

	Запрос.УстановитьПараметр("ПЕРИОД",ДатаОстатков);
		Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	ТК.ДобавитьСтроку("UNISTRING;NUMBER_DOC;FROM_ID;TO_ID;DOC_DATE;"+
	"SUMMA;MASSA;OBEM;COMMENTS;QTY;DOCS_TYPE;INTERM_ID;"+
	"KOL_VO_PALLET;GRUZ_TYPE_ID;DELETED;TIME1;TIME2;AVAILABILITY_TIME;");

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ВыгрузкаБЯССЕРВЕР(ВыборкаДетальныеЗаписи.Ссылка) ;
     		
	КонецЦикла;
 	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаПоРегламентномуЗаданию(Команда)
	омРегламентныеЗаданияСЕРВЕР.ВыгрузкаСчетФактурВФайл();
КонецПроцедуры


&НаКлиенте
Процедура СписокРасходныхОрдеровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДокБЯС=ПолучитьДокБЯСПоНомеру(Элементы.СписокРасходныхОрдеров.ТекущиеДанные.НомерДокБЯС,Элементы.СписокРасходныхОрдеров.ТекущиеДанные.ДатаДокБЯС);
	ОткрытьЗначение(ДокБЯС);
КонецПроцедуры

&НаСервере
Функция ПолучитьДокБЯСПоНомеру(НомерДок,ДатаДок)
	
	Возврат Документы.БольшаяЯчеистаяСборка.НайтиПоНомеру(НомерДок,ДатаДок);
КонецФункции
